import banglawords from "../src/numbertobanglawords";

describe("TranslatToBanglaFormat", () => {
    test("check south asia number system", () => {
        const data: [number, string][] = [
            [12335558852222222222, "সীমা অতিক্রম করেছে"],
            [undefined, ""],
            [1.05, "এক টাকা ও পাঁচ পয়সা"],
            [1.55, "এক টাকা ও পঞ্চান্ন পয়সা"],
            [1.599, "এক টাকা ও ঊনষাট পয়সা"],
            [
                1235685.599,
                "বারো লাখ পঁয়ত্রিশ হাজার ছয়শো পঁচাশি টাকা ও ঊনষাট পয়সা",
            ],
            [
                12345678912345678.599,
                "বারো কোয়াড্রিলিয়ন তিনশো পঁয়তাল্লিশ লাখ সাতষট্টি হাজার আটশো একানব্বই কোটি তেইশ লাখ পঁয়তাল্লিশ হাজার ছয়শো আটাত্তর টাকা",
            ],

            [8, "আট টাকা"],
            [49, "ঊনপঞ্চাশ টাকা"],
            [400, "চারশো টাকা"],
            [704, "সাতশো চার টাকা"],
            [939, "নয়শো ঊনচল্লিশ টাকা"],
            [3204, "তিন হাজার দুইশো চার টাকা"],
            [20001, "বিশ হাজার এক টাকা"],
            [20308, "বিশ হাজার তিনশো আট টাকা"],
            [50000, "পঞ্চাশ হাজার টাকা"],
            [200007, "দুই লাখ সাত টাকা"],
            [700000, "সাত লাখ টাকা"],
            [2000603, "বিশ লাখ ছয়শো তিন টাকা"],
            [5000000, "পঞ্চাশ লাখ টাকা"],
            [1923908, "ঊনিশ লাখ তেইশ হাজার নয়শো আট টাকা"],
            [83641705, "আট কোটি ছত্রিশ লাখ একচল্লিশ হাজার সাতশো পাঁচ টাকা"],
            [80000000, "আট কোটি টাকা"],
            [80000002, "আট কোটি দুই টাকা"],
            [500000000, "পঞ্চাশ কোটি টাকা"],
            [501619500, "পঞ্চাশ কোটি ষোল লাখ ঊনিশ হাজার পাঁচশো টাকা"],
            [900000000, "নব্বই কোটি টাকা"],
            [
                987654321,
                "আটানব্বই কোটি ছিয়াত্তর লাখ চুয়ান্ন হাজার তিনশো একুশ টাকা",
            ],
            [990000000, "নিরানব্বই কোটি টাকা"],
            [990000001, "নিরানব্বই কোটি এক টাকা"],
            [
                999999999,
                "নিরানব্বই কোটি নিরানব্বই লাখ নিরানব্বই হাজার নয়শো নিরানব্বই টাকা",
            ],
            [
                9999999999,
                "নয়শো নিরানব্বই কোটি নিরানব্বই লাখ নিরানব্বই হাজার নয়শো নিরানব্বই টাকা",
            ],
            [
                99999999999,
                "নয় হাজার নয়শো নিরানব্বই কোটি নিরানব্বই লাখ নিরানব্বই হাজার নয়শো নিরানব্বই টাকা",
            ],
            [
                999999999999,
                "নিরানব্বই হাজার নয়শো নিরানব্বই কোটি নিরানব্বই লাখ নিরানব্বই হাজার নয়শো নিরানব্বই টাকা",
            ],

            [1000000000000000, "এক কোয়াড্রিলিয়ন টাকা"],
            [1000000000000, "এক লাখ কোটি টাকা"],
            [10000000000, "এক হাজার কোটি টাকা"],
            [10000000, "এক কোটি টাকা"],
            [100000, "এক লাখ টাকা"],
            [1000, "এক হাজার টাকা"],
            [100, "একশো টাকা"],
        ];

        data.forEach(([value, eqvalue]) => {
            expect(banglawords(value)).toBe(eqvalue);
        });
    });
    test("check global number system", () => {
        const data: [number, string][] = [
            [undefined, ""],
            [1.05, "এক টাকা ও পাঁচ পয়সা"],
            [1.5, "এক টাকা ও পঞ্চাশ পয়সা"],
            [1.555, "এক টাকা ও পঞ্চান্ন পয়সা"],
            [1, "এক টাকা"],
            [10, "দশ টাকা"],
            [100, "একশো টাকা"],
            [102, "একশো দুই টাকা"],
            [1023, "এক হাজার তেইশ টাকা"],
            [12345, "বারো হাজার তিনশো পঁয়তাল্লিশ টাকা"],
            [12345678, "বারো মিলিয়ন তিনশো পঁয়তাল্লিশ হাজার ছয়শো আটাত্তর টাকা"],
            [
                123456788,
                "একশো তেইশ মিলিয়ন চারশো ছাপ্পান্ন হাজার সাতশো আটাশি টাকা",
            ],
            [
                1234567889,
                "এক বিলিয়ন দুইশো চৌত্রিশ মিলিয়ন পাঁচশো সাতষট্টি হাজার আটশো ঊননব্বই টাকা",
            ],
            [
                12345678899,
                "বারো বিলিয়ন তিনশো পঁয়তাল্লিশ মিলিয়ন ছয়শো আটাত্তর হাজার আটশো নিরানব্বই টাকা",
            ],
            [
                123456788999,
                "একশো তেইশ বিলিয়ন চারশো ছাপ্পান্ন মিলিয়ন সাতশো আটাশি হাজার নয়শো নিরানব্বই টাকা",
            ],
            [
                1234567889991,
                "এক ট্রিলিয়ন দুইশো চৌত্রিশ বিলিয়ন পাঁচশো সাতষট্টি মিলিয়ন আটশো ঊননব্বই হাজার নয়শো একানব্বই টাকা",
            ],
            [
                12345678899915,
                "বারো ট্রিলিয়ন তিনশো পঁয়তাল্লিশ বিলিয়ন ছয়শো আটাত্তর মিলিয়ন আটশো নিরানব্বই হাজার নয়শো পনেরো টাকা",
            ],
            [
                123456788999158,
                "একশো তেইশ ট্রিলিয়ন চারশো ছাপ্পান্ন বিলিয়ন সাতশো আটাশি মিলিয়ন নয়শো নিরানব্বই হাজার একশো আটান্ন টাকা",
            ],

            [1000000000000000, "এক কোয়াড্রিলিয়ন টাকা"],
            [10000000000000, "দশ ট্রিলিয়ন টাকা"],
            [1000000000000, "এক ট্রিলিয়ন টাকা"],
            [10000000000, "দশ বিলিয়ন টাকা"],
            [1000000000, "এক বিলিয়ন টাকা"],
            [10000000, "দশ মিলিয়ন টাকা"],
            [100000, "একশো হাজার টাকা"],
            [1000, "এক হাজার টাকা"],
            [100, "একশো টাকা"],
        ];

        data.forEach(([value, eqvalue]) => {
            expect(banglawords(value, false)).toBe(eqvalue);
        });
    });
});
